GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p16F17575.inc
;----- LATC Bits -----------------------------------------------------
LATC0            EQU  H'0000'
LATC1            EQU  H'0001'
LATC2            EQU  H'0002'
LATC3            EQU  H'0003'
LATC4            EQU  H'0004'
LATC5            EQU  H'0005'
LATC6            EQU  H'0006'
LATC7            EQU  H'0007'


;----- LATD Bits -----------------------------------------------------
LATD0            EQU  H'0000'
LATD1            EQU  H'0001'
LATD2            EQU  H'0002'
LATD3            EQU  H'0003'
LATD4            EQU  H'0004'
LATD5            EQU  H'0005'
LATD6            EQU  H'0006'
LATD7            EQU  H'0007'


;----- LATE Bits -----------------------------------------------------
LATE0            EQU  H'0000'
LATE1            EQU  H'0001'
LATE2            EQU  H'0002'


;----- PIR0 Bits -----------------------------------------------------
INTF             EQU  H'0000'
IOCIF            EQU  H'0004'
TMR0IF           EQU  H'0005'


;----- PIR1 Bits -----------------------------------------------------
NVMIF            EQU  H'0000'
CRCIF            EQU  H'0001'
SCANIF           EQU  H'0002'
ACTIF            EQU  H'0003'
CSWIF            EQU  H'0004'
OSFIF            EQU  H'0005'
TMR1IF           EQU  H'0006'
TMR1GIF          EQU  H'0007'


;----- PIR2 Bits -----------------------------------------------------
TMR3IF           EQU  H'0000'
TMR3GIF          EQU  H'0001'
TMR2IF           EQU  H'0002'
TMR4IF           EQU  H'0003'
TMR6IF           EQU  H'0004'
CCP1IF           EQU  H'0005'
CCP2IF           EQU  H'0006'


;----- PIR3 Bits -----------------------------------------------------
PWM1PIF          EQU  H'0000'
PWM1IF           EQU  H'0001'
PWM2PIF          EQU  H'0002'
PWM2IF           EQU  H'0003'


;----- PIR4 Bits -----------------------------------------------------
NCO1IF           EQU  H'0000'
CWG1IF           EQU  H'0001'
CLC1IF           EQU  H'0002'
CLC2IF           EQU  H'0003'
CLC3IF           EQU  H'0004'
CLC4IF           EQU  H'0005'
TX1IF            EQU  H'0006'
RC1IF            EQU  H'0007'


;----- PIR5 Bits -----------------------------------------------------
TX2IF            EQU  H'0000'
RC2IF            EQU  H'0001'
SSP1IF           EQU  H'0002'
BCL1IF           EQU  H'0003'
SSP2IF           EQU  H'0004'
BCL2IF           EQU  H'0005'
CM1IF            EQU  H'0006'
CMLP1IF          EQU  H'0007'


;----- PIR6 Bits -----------------------------------------------------
ADIF             EQU  H'0000'
ADTIF            EQU  H'0001'
ZCDIF            EQU  H'0002'
IOCSRIF          EQU  H'0007'


;----- PIR7 Bits -----------------------------------------------------
OPA1CIF          EQU  H'0000'
OPA2CIF          EQU  H'0001'
OPA3CIF          EQU  H'0002'
OPA4CIF          EQU  H'0003'


;----- PIE0 Bits -----------------------------------------------------
INTE             EQU  H'0000'
IOCIE            EQU  H'0004'
TMR0IE           EQU  H'0005'


;----- PIE1 Bits -----------------------------------------------------
NVMIE            EQU  H'0000'
CRCIE            EQU  H'0001'
SCANIE           EQU  H'0002'
ACTIE            EQU  H'0003'
CSWIE            EQU  H'0004'
OSFIE            EQU  H'0005'
TMR1IE           EQU  H'0006'
TMR1GIE          EQU  H'0007'


;----- PIE2 Bits -----------------------------------------------------
TMR3IE           EQU  H'0000'
TMR3GIE          EQU  H'0001'
TMR2IE           EQU  H'0002'
TMR4IE           EQU  H'0003'
TMR6IE           EQU  H'0004'
CCP1IE           EQU  H'0005'
CCP2IE           EQU  H'0006'


;----- PIE3 Bits -----------------------------------------------------
PWM1PIE          EQU  H'0000'
PWM1IE           EQU  H'0001'
PWM2PIE          EQU  H'0002'
PWM2IE           EQU  H'0003'


;----- PIE4 Bits -----------------------------------------------------
NCO1IE           EQU  H'0000'
CWG1IE           EQU  H'0001'
CLC1IE           EQU  H'0002'
CLC2IE           EQU  H'0003'
CLC3IE           EQU  H'0004'
CLC4IE           EQU  H'0005'
TX1IE            EQU  H'0006'
RC1IE            EQU  H'0007'


;----- PIE5 Bits -----------------------------------------------------
TX2IE            EQU  H'0000'
RC2IE            EQU  H'0001'
SSP1IE           EQU  H'0002'
BCL1IE           EQU  H'0003'
SSP2IE           EQU  H'0004'
BCL2IE           EQU  H'0005'
CM1IE            EQU  H'0006'
CMLP1IE          EQU  H'0007'


;----- PIE6 Bits -----------------------------------------------------
ADIE             EQU  H'0000'
ADTIE            EQU  H'0001'
ZCDIE            EQU  H'0002'
IOCSRIE          EQU  H'0007'


;----- PIE7 Bits -----------------------------------------------------
OPA1CIE          EQU  H'0000'
OPA2CIE          EQU  H'0001'
OPA3CIE          EQU  H'0002'
OPA4CIE          EQU  H'0003'


;----- PMD0 Bits -----------------------------------------------------
NVMMD            EQU  H'0000'
CRCMD            EQU  H'0001'
SCANMD           EQU  H'0002'
SYSCMD           EQU  H'0003'
ACTMD            EQU  H'0004'
IOCMD            EQU  H'0005'
CLKRMD           EQU  H'0006'
TMR0MD           EQU  H'0007'


;----- PMD1 Bits -----------------------------------------------------
TMR1MD           EQU  H'0000'
TMR3MD           EQU  H'0001'
TMR2MD           EQU  H'0002'
TMR4MD           EQU  H'0003'
TMR6MD           EQU  H'0004'
CCP1MD           EQU  H'0005'
CCP2MD           EQU  H'0006'
PWM1MD           EQU  H'0007'


;----- PMD2 Bits -----------------------------------------------------
PWM2MD           EQU  H'0000'
NCO1MD           EQU  H'0001'
CWG1MD           EQU  H'0002'
CLC1MD           EQU  H'0003'
CLC2MD           EQU  H'0004'
CLC3MD           EQU  H'0005'
CLC4MD           EQU  H'0006'


;----- PMD3 Bits -----------------------------------------------------
UART1MD          EQU  H'0001'
UART2MD          EQU  H'0002'
MSSP1MD          EQU  H'0003'
MSSP2MD          EQU  H'0004'
FVRMD            EQU  H'0005'
CM1MD            EQU  H'0006'
CMLP1MD          EQU  H'0007'


;----- PMD4 Bits -----------------------------------------------------
ADCMD            EQU  H'0000'
DAC1MD           EQU  H'0001'
DAC2MD           EQU  H'0002'
OPA1MD           EQU  H'0003'
OPA2MD           EQU  H'0004'
OPA3MD           EQU  H'0005'
OPA4MD           EQU  H'0006'
ZCDMD            EQU  H'0007'


;----- PMD5 Bits -----------------------------------------------------
PORTWMD          EQU  H'0000'
VREFLPMD         EQU  H'0001'
APMMD            EQU  H'0002'


;----- WDTCON0 Bits -----------------------------------------------------
SEN              EQU  H'0000'
SWDTEN           EQU  H'0000'
WDTSEN           EQU  H'0000'
PS0              EQU  H'0001'
PS1              EQU  H'0002'
PS2              EQU  H'0003'
PS3              EQU  H'0004'
PS4              EQU  H'0005'
WDTPS0           EQU  H'0001'
WDTPS1           EQU  H'0002'
WDTPS2           EQU  H'0003'
WDTPS3           EQU  H'0004'
WDTPS4           EQU  H'0005'


;----- WDTCON1 Bits -----------------------------------------------------
WINDOW0          EQU  H'0000'
WINDOW1          EQU  H'0001'
WINDOW2          EQU  H'0002'
CS0_WDTCON1      EQU  H'0004'
CS1_WDTCON1      EQU  H'0005'
CS2_WDTCON1      EQU  H'0006'
WDTWINDOW0       EQU  H'0000'
WDTWINDOW1       EQU  H'0001'
WDTWINDOW2       EQU  H'0002'
WDTCS0           EQU  H'0004'
WDTCS1           EQU  H'0005'
WDTCS2           EQU  H'0006'


;----- WDTPS Bits -----------------------------------------------------
PSCNT0           EQU  H'0000'
PSCNT1           EQU  H'0001'
PSCNT2           EQU  H'0002'
PSCNT3           EQU  H'0003'
PSCNT4           EQU  H'0004'
PSCNT5           EQU  H'0005'
PSCNT6           EQU  H'0006'
PSCNT7           EQU  H'0007'


;----- WDTPSH Bits -----------------------------------------------------
PSCNT8           EQU  H'0000'
PSCNT9           EQU  H'0001'
PSCNT10          EQU  H'0002'
PSCNT11          EQU  H'0003'
PSCNT12          EQU  H'0004'
PSCNT13          EQU  H'0005'
PSCNT14          EQU  H'0006'
PSCNT15          EQU  H'0007'


