GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p16F17575.inc
;----- OPA2CON3 Bits -----------------------------------------------------
NCH0             EQU  H'0000'
NCH1             EQU  H'0001'
NCH2             EQU  H'0002'
NCH3             EQU  H'0003'
OPA2NCH0         EQU  H'0000'
OPA2NCH1         EQU  H'0001'
OPA2NCH2         EQU  H'0002'
OPA2NCH3         EQU  H'0003'


;----- OPA2OFFSET Bits -----------------------------------------------------
OFFSET0          EQU  H'0000'
OFFSET1          EQU  H'0001'
OFFSET2          EQU  H'0002'
OFFSET3          EQU  H'0003'
OFFSET4          EQU  H'0004'
OFFSET5          EQU  H'0005'
OFFSET6          EQU  H'0006'
OFFSET7          EQU  H'0007'
OPA2OFFSET0      EQU  H'0000'
OPA2OFFSET1      EQU  H'0001'
OPA2OFFSET2      EQU  H'0002'
OPA2OFFSET3      EQU  H'0003'
OPA2OFFSET4      EQU  H'0004'
OPA2OFFSET5      EQU  H'0005'
OPA2OFFSET6      EQU  H'0006'
OPA2OFFSET7      EQU  H'0007'


;----- OPA2CON4 Bits -----------------------------------------------------
OFCST            EQU  H'0002'
OFCSEL0          EQU  H'0000'
OFCSEL1          EQU  H'0001'
OPA2OFCST        EQU  H'0002'
OPA2OFCSEL0      EQU  H'0000'
OPA2OFCSEL1      EQU  H'0001'


;----- OPA4CON0 Bits -----------------------------------------------------
UG               EQU  H'0003'
EN               EQU  H'0007'
UG0              EQU  H'0003'
OPA4UG           EQU  H'0003'
OPA4EN           EQU  H'0007'


;----- OPA4CON2 Bits -----------------------------------------------------
PCH0             EQU  H'0000'
PCH1             EQU  H'0001'
PCH2             EQU  H'0002'
OPA4PCH0         EQU  H'0000'
OPA4PCH1         EQU  H'0001'
OPA4PCH2         EQU  H'0002'


;----- OPA4CON3 Bits -----------------------------------------------------
NCH0             EQU  H'0000'
NCH1             EQU  H'0001'
NCH2             EQU  H'0002'
OPA4NCH0         EQU  H'0000'
OPA4NCH1         EQU  H'0001'
OPA4NCH2         EQU  H'0002'


;----- OPA4OFFSET Bits -----------------------------------------------------
OFFSET0          EQU  H'0000'
OFFSET1          EQU  H'0001'
OFFSET2          EQU  H'0002'
OFFSET3          EQU  H'0003'
OFFSET4          EQU  H'0004'
OFFSET5          EQU  H'0005'
OFFSET6          EQU  H'0006'
OFFSET7          EQU  H'0007'
OPA4OFFSET0      EQU  H'0000'
OPA4OFFSET1      EQU  H'0001'
OPA4OFFSET2      EQU  H'0002'
OPA4OFFSET3      EQU  H'0003'
OPA4OFFSET4      EQU  H'0004'
OPA4OFFSET5      EQU  H'0005'
OPA4OFFSET6      EQU  H'0006'
OPA4OFFSET7      EQU  H'0007'


;----- OPA4CON4 Bits -----------------------------------------------------
OFCST            EQU  H'0002'
OFCSEL0          EQU  H'0000'
OFCSEL1          EQU  H'0001'
OPA4OFCST        EQU  H'0002'
OPA4OFCSEL0      EQU  H'0000'
OPA4OFCSEL1      EQU  H'0001'


;----- OPA3CON0 Bits -----------------------------------------------------
UG               EQU  H'0003'
EN               EQU  H'0007'
UG0              EQU  H'0003'
OPA3UG           EQU  H'0003'
OPA3EN           EQU  H'0007'


;----- OPA3CON2 Bits -----------------------------------------------------
PCH0             EQU  H'0000'
PCH1             EQU  H'0001'
PCH2             EQU  H'0002'
OPA3PCH0         EQU  H'0000'
OPA3PCH1         EQU  H'0001'
OPA3PCH2         EQU  H'0002'


;----- OPA3CON3 Bits -----------------------------------------------------
NCH0             EQU  H'0000'
NCH1             EQU  H'0001'
NCH2             EQU  H'0002'
OPA3NCH0         EQU  H'0000'
OPA3NCH1         EQU  H'0001'
OPA3NCH2         EQU  H'0002'


;----- OPA3OFFSET Bits -----------------------------------------------------
OFFSET0          EQU  H'0000'
OFFSET1          EQU  H'0001'
OFFSET2          EQU  H'0002'
OFFSET3          EQU  H'0003'
OFFSET4          EQU  H'0004'
OFFSET5          EQU  H'0005'
OFFSET6          EQU  H'0006'
OFFSET7          EQU  H'0007'
OPA3OFFSET0      EQU  H'0000'
OPA3OFFSET1      EQU  H'0001'
OPA3OFFSET2      EQU  H'0002'
OPA3OFFSET3      EQU  H'0003'
OPA3OFFSET4      EQU  H'0004'
OPA3OFFSET5      EQU  H'0005'
OPA3OFFSET6      EQU  H'0006'
OPA3OFFSET7      EQU  H'0007'


;----- OPA3CON4 Bits -----------------------------------------------------
OFCST            EQU  H'0002'
OFCSEL0          EQU  H'0000'
OFCSEL1          EQU  H'0001'
OPA3OFCST        EQU  H'0002'
OPA3OFCSEL0      EQU  H'0000'
OPA3OFCSEL1      EQU  H'0001'


;----- NVMADR Bits -----------------------------------------------------
NVMADR0          EQU  H'0000'
NVMADR1          EQU  H'0001'
NVMADR2          EQU  H'0002'
NVMADR3          EQU  H'0003'
NVMADR4          EQU  H'0004'
NVMADR5          EQU  H'0005'
NVMADR6          EQU  H'0006'
NVMADR7          EQU  H'0007'


;----- NVMADRH Bits -----------------------------------------------------
NVMADR8          EQU  H'0000'
NVMADR9          EQU  H'0001'
NVMADR10         EQU  H'0002'
NVMADR11         EQU  H'0003'
NVMADR12         EQU  H'0004'
NVMADR13         EQU  H'0005'
NVMADR14         EQU  H'0006'


;----- NVMDAT Bits -----------------------------------------------------
NVMDAT0          EQU  H'0000'
NVMDAT1          EQU  H'0001'
NVMDAT2          EQU  H'0002'
NVMDAT3          EQU  H'0003'
NVMDAT4          EQU  H'0004'
NVMDAT5          EQU  H'0005'
NVMDAT6          EQU  H'0006'
NVMDAT7          EQU  H'0007'


;----- NVMDATH Bits -----------------------------------------------------
NVMDAT8          EQU  H'0000'
NVMDAT9          EQU  H'0001'
NVMDAT10         EQU  H'0002'
NVMDAT11         EQU  H'0003'
NVMDAT12         EQU  H'0004'
NVMDAT13         EQU  H'0005'


;----- NVMCON1 Bits -----------------------------------------------------
RD               EQU  H'0000'
WR               EQU  H'0001'
WREN             EQU  H'0002'
WRERR            EQU  H'0003'
FREE             EQU  H'0004'
LWLO             EQU  H'0005'
NVMREGS          EQU  H'0006'


;----- SCANCON0 Bits -----------------------------------------------------
INTM             EQU  H'0003'
DABORT           EQU  H'0004'
BUSY             EQU  H'0005'
SGO              EQU  H'0006'
EN               EQU  H'0007'


;----- CRCDATA Bits -----------------------------------------------------
DATA0            EQU  H'0000'
DATA1            EQU  H'0001'
DATA2            EQU  H'0002'
DATA3            EQU  H'0003'
DATA4            EQU  H'0004'
DATA5            EQU  H'0005'
DATA6            EQU  H'0006'
DATA7            EQU  H'0007'


